libretiny-eu/libretiny/boards/cb2l/variant.h
/* This file was auto-generated from cb2l.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         9
#define NUM_DIGITAL_PINS   9
#define NUM_ANALOG_OUTPUTS 0

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 0

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 1
#define PIN_SERIAL1_RX          5u // GPIO10
#define PIN_SERIAL1_TX          7u // GPIO11

// Pin function macros
// -------------------
#define PIN_FUNCTION_P0   6u // GPIO0
#define PIN_FUNCTION_P6   2u // GPIO6
#define PIN_FUNCTION_P7   1u // GPIO7
#define PIN_FUNCTION_P8   0u // GPIO8
#define PIN_FUNCTION_P10  5u // GPIO10
#define PIN_FUNCTION_P11  7u // GPIO11
#define PIN_FUNCTION_P21  8u // GPIO21
#define PIN_FUNCTION_P24  4u // GPIO24
#define PIN_FUNCTION_P26  3u // GPIO26
#define PIN_FUNCTION_PWM0 2u // GPIO6
#define PIN_FUNCTION_PWM1 1u // GPIO7
#define PIN_FUNCTION_PWM2 0u // GPIO8
#define PIN_FUNCTION_PWM4 4u // GPIO24
#define PIN_FUNCTION_PWM5 3u // GPIO26
#define PIN_FUNCTION_RX1  5u // GPIO10
#define PIN_FUNCTION_SCL2 6u // GPIO0
#define PIN_FUNCTION_SDA1 8u // GPIO21
#define PIN_FUNCTION_TX1  7u // GPIO11
#define PIN_FUNCTION_TX2  6u // GPIO0
